DangDuc1999/F103/STM32F10x_IMU_MPU6050_hard_i2c/soft_I2C.h
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"

#define 	SCL_I2C1_Pin						GPIO_Pin_6		// scl in output mode
#define		SDA_I2C1_Pin						GPIO_Pin_7		// sda must have both in and out

#define		I2C1_port								GPIOB

#define 	SCL_H				GPIOB->BSRR = GPIO_Pin_6
#define 	SCL_L				GPIOB->BRR = 	GPIO_Pin_6

#define 	SDA_H				GPIOB->BSRR = GPIO_Pin_7
#define 	SDA_L				GPIOB->BRR = 	GPIO_Pin_7
#define 	SDA_VAL			GPIOB->IDR & GPIO_Pin_7

void soft_i2c_Init(void);
void soft_i2c_start(void);
void soft_i2c_stop(void);

void 	soft_i2c_make_ack(void);
void 	soft_i2c_make_nack(void);
uint8_t soft_i2c_wait_ack(void);



uint8_t soft_i2c_send_single_byte(uint8_t data);
uint8_t soft_i2c_read_single_byte(void);

void soft_i2c_send_burst_bytes(uint8_t Device_Addr, uint8_t Reg_Addr, uint8_t* data, uint8_t num_bytes);
void soft_i2c_read_burst_bytes(uint8_t Device_Addr, uint8_t Reg_Addr, uint8_t* data, uint8_t num_bytes);




